# BuiltInFailures.BlendFailures Class

---
Failures about Blend.
SystemObject Autodesk.Revit.DBBuiltInFailuresBlendFailures
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

    public static class BlendFailures

    Public NotInheritable Class BlendFailures

    public ref class BlendFailures abstract sealed

    [<AbstractClassAttribute>]
    [<SealedAttribute>]
    type BlendFailures = class end
The BuiltInFailuresBlendFailures type exposes the following members.
| Name| Description
---|---|---
| CannotDrawBlend|  Can't create blend.
Top
#### Reference
Autodesk.Revit.DB Namespace